Revit 2027 API
Line.CreateBound Method
 Creates a new instance of a bound linear curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Line CreateBound(
	XYZ endpoint1,
	XYZ endpoint2
)
Public Shared Function CreateBound (
	endpoint1 As XYZ,
	endpoint2 As XYZ
) As Line
public:
static Line^ CreateBound(
	XYZ^ endpoint1,
	XYZ^ endpoint2
)
static member CreateBound :
        endpoint1 : XYZ *
        endpoint2 : XYZ -> Line
Parameters
endpoint1 XYZ
 The first line endpoint.
endpoint2 XYZ
 The second line endpoint.
Return Value
Line
 The new bound line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
ArgumentsInconsistentException |  Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Example
// define start and end for bound line
XYZ startPoint = new XYZ(0, 0, 0);
XYZ endPoint = new XYZ(10, 10, 10);
// create line
Line line = Line.CreateBound(startPoint, endPoint);
See Also
Reference
Line Class
Autodesk.Revit.DB Namespace